{"date": "2020-04-14T02:23:15+00:00", "title": "Stocks - Europe to Edge Higher Amid Virus Peaking Hopes", "content": "By Peter Nurse\n\nInvesting.com - European stock markets are set to edge higher Tuesday, as traders return from the Easter break hopeful the coronavirus outbreak may be peaking. Sentiment though remains cautious with the start of the earnings season set to illustrate the extent of the damage done to the corporate sector.\n\nAt 2:15 AM ET (0600 GMT), the DAX futures contract in Germany traded 0.3% higher. CAC 40 futures were up 1.7%, while the FTSE 100 futures contract in the U.K. rose 0.2%.\n\nThe number of confirmed cases of the Covid-19 virus is rapidly approaching two million globally, but Italy – the worst hit country in Europe in terms of deaths - reported Monday that the number of its new cases slowed to 3,153 from a previous 4,092, the lowest since April 7.\n\nIn addition, many countries are now beginning to ease some restrictions. Spain has allowed around 300,000 nonessential workers to return to their jobs, while Italy will allow a narrow range of businesses to resume operations this week.\n\nHelping the tone Tuesday was the release of better-than-expected Chinese trade data for March as year-on-year exports and imports contracted less than expected.\n\nStill, any enthusiasm may be tempered by the start of the earnings season, which will likely deal a severe blow to corporate profits.\n\nU.S. banking giants JPMorgan Chase (NYSE:JPM) and Wells Fargo (NYSE:WFC) are due to issue first quarter results before the bell, and their numbers are likely to be studied carefully as banks tend to be viewed as bellwethers for the wider economy because of their central position in the financial system.\n\nIn Europe, Renault (PA:RENA) announced plans Tuesday to sell its stake in its Chinese joint venture with Dongfeng Motor Corporation to Dongfeng. The French company's debt was downgraded to junk just before Easter.\n\nSwiss wealth manager Julius Baer (SIX:BAER) said Tuesday it will propose splitting its 2019 dividend payment into two halves. The announcement follows similar proposals by UBS and Credit Suisse (SIX:CSGN) after requests from Swiss financial supervisor FINMA that they conserve capital amid the coronavirus pandemic.\n\nStory continues\n\nOil prices have edged higher Tuesday following the weekend’s deal to cut output by 9.7 million barrels per day in May and June, However, gains are limited as the cuts are still dwarfed by the likely drop in demand in April given the global economic shutdown.\n\nThe American Petroleum Institute will report its weekly U.S. oil inventoriy data after the bell, updating traders on he extent of the demand destruction.\n\nLast week the API reported a rise in crude stockpiles of nearly 12 million barrels.\n\nAt 2:15 AM ET, U.S. crude futures traded 1.0% higher at $22.63 a barrel. The international benchmark Brent contract rose 1.5% to $32.20.\n\nElsewhere, gold futures rose 0.4% to $1,767.85/oz, while EUR/USD traded at 1.0940, up 0.3% on the day.\n\nRelated Articles\n\nAdministrators of NMC Health revamp company's board\n\nAustralia stocks higher at close of trade; S&P/ASX 200 up 1.87%\n\nSoftBank record loss estimate renews asset sale focus", "link": "https://finance.yahoo.com/news/stocks-europe-edge-higher-amid-022315161.html?.tsrc=rss", "symbols": ["A0TUHD.F", "BAER.SW", "BAERE.SW", "CMC1.F", "CS.US", "CSGN.SW", "EUR.FOREX", "EURUSD.FOREX", "JBAXY.US", "JPM-PC.US", "JPM-PD.US", "JPM.BA", "JPM.US", "JPM4CN.F", "JPMC34.SA", "JPRG-P.US", "USD.FOREX", "WFC.US", "XAU.FOREX", "XAUUSD.FOREX"], "tags": ["DONGFENG MOTOR CORPORATION", "EUROPE", "EUROPEAN STOCK MARKETS"], "sentiment": {"polarity": -0.949, "neg": 0.093, "neu": 0.841, "pos": 0.066}}
